{
  "worldgen": [
    "go to every biome and redefine the categories it belongs to. Only very specific biomes should have THEMED_TREES as an attribute",
    "Demystify stuff like coniferous being tagged where it doesn't make sense on an oak forest. That type of thing. We want the tree spawn filters to reliably place trees in biomes they are supposed to be in",
    "go in and remove some of the trees spawned in the OTG config for more generic biomes. thatll give recurrent complex the space it needs to fill in missing trees without excessive clutter",
    {
      "completed biomes": [
        "Temperate Forest",
        "Temperate Birch Forest",
        "Elder Swamp",
        "Coniferous Woods",
        "2Great Alps",
        "Anvil Mountains (abstract only)",
        "Cherry Islands",
        "Dunes",
        "Scorched Mesa",
        "Bonzai Jungle",
        "Jaded Hills"
      ]
    },

    "Define biome rules for every type of tree. THEMED_TREES biome filter should now work 100% of the time.",
    "Give all the current trees a once-over for bad data. Ensure they're spawning in their respective biomes based on the rules I set up",
    "Organize RC structures into folders. Load each one and remove bad ones. Ensure they spawn in the right biomes, while still spawning in as many as possible",
    "convert ruins builds to recurrent complex ones. will need to have a temp install of the ruins mod, but the goal is to depricate it completely",
    "download epic tree pack saves and explore https://www.reddit.com/r/Worldpainter/comments/2cgxo7/list_of_downloadable_custom_trees/",
    "Sort through tree packs and import the good ones into recurrent complex",

    "find all mods that generate ore. Disable the generation, and make a list of ore names /w id's and a rough rarity rating 1-10",
    "use customoregen mod in tandem with Sprocket to generate ore XML files. Here's the homepage for the scripting tool: https://github.com/reteo/Sprocket",
    "tweak dimension settings for The Great Below. Disable oregen in the biome's config, and use customoregen to generate uniquely structured ore veins that have lots of resources",
    "commit to the idea that The Great Below is the dangerous mining dimension. Rarer ores require you to go deeper and deeper into the depths, some of which are on critical progression paths and can only be found at the bottom of this dimension",

    "add more and more complex structures to recurrent complex. Towns, castles, villiages, mazes, dungeons, etc. There's a lot of content on the internet for minecraft, modded and otherwise, so it makes sense to use some of it in worldgen",
    "add big random dungeons to the great below"
  ],
  "ideas": [
    "look into recurrent complex's 'space' blocks. Looks like they can be used as block variables in structures. Gonna be good for loot tables?"
  ]
}

see the StatueTemple biome filter
for good example of how to do weighted biome spawning